[Endpoint - LOLGlob Execution with PowerShell or CMD - Rule]
action.correlationsearch.annotations = {"mitre_attack":["T1059.001","T1059.003"]}
action.correlationsearch.detection_type = ebd
action.correlationsearch.enabled = 1
action.correlationsearch.label = LOLGlob Execution with PowerShell or CMD
action.email.pdf.footer_enabled = 1
action.email.pdf.header_enabled = 1
action.email.pdf.html_image_rendering = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable = 1
action.notable.param._entities = [{"risk_object_field":"N/A","risk_object_type":"N/A","risk_score":0}]
action.notable.param.drilldown_searches = [{"disabled":false,"earliest_offset":"$info_min_time$","latest_offset":"$info_max_time$","name":"View Detection Results","search":"| tstats `security_content_summariesonly` count min(_time) AS firstTime max(_time) AS lastTime FROM datamodel=sigma_windows.process_creation WHERE process_creation.Image IN (\"*powershell.exe\" \"*cmd.exe\") BY process_creation.ParentImage process_creation.ParentCommandLine process_creation.CommandLine process_creation.User process_creation.dest_name \n| `drop_dm_object_name(process_creation)` \n| rename CommandLine AS CommandLine_ScriptBlockText\n| eval vendor_product=\"Microsoft Sysmon\"\n| append \n    [| tstats `security_content_summariesonly` count min(_time) AS firstTime max(_time) AS lastTime FROM datamodel=sigma_windows.ps_script BY ps_script.ScriptBlockText ps_script.dest_name \n    | `drop_dm_object_name(ps_script)` \n    | rename ScriptBlockText AS CommandLine_ScriptBlockText\n    | eval vendor_product=\"Microsoft PowerShell\"\n        ] \n| regex CommandLine_ScriptBlockText=\"(\\(gcm|gal|Get-Command|Get-Alias|get-command|get-alias|where|dir)(.*[\\*\\?\\[\\]\\{\\}].*\\))\"\n| `security_content_ctime(firstTime)` \n| `security_content_ctime(lastTime)`\n| eval User=if(isnotnull(User), User, \"unknown\")\n| table dest_name User CommandLine_ScriptBlockText firstTime lastTime vendor_product count\n| `lolglob_execution_with_powerShell_or_cmd_filter`\n| search dest_name=\"$dest_name$\" User=\"$user$\""}]
action.notable.param.investigation_type = default
action.notable.param.rule_description = Glob patters are a way malicious actors can evade detection. This analytic will review PowerShell and CMD execution to see if this is occurring. By checking for the use of Get-Command or Get-Alias and their respective aliases, tied with and wild card that is valid for these shells we can alert on the activity. This alert has NOT been tested extensively.\
- https://0xv1n.github.io/LOLGlobs/about
action.notable.param.rule_title = LOLGlob Execution with PowerShell or CMD
action.notable.param.security_domain = endpoint
action.notable.param.severity = high
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param._risk = []
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.suppress.period = 0s
alert.track = 1
allow_skew = 100%
counttype = number of events
cron_schedule = */15 * * * *
description = Glob patters are a way malicious actors can evade detection. This analytic will review PowerShell and CMD execution to see if this is occurring. By checking for the use of Get-Command or Get-Alias and their respective aliases, tied with and wild card that is valid for these shells we can alert on the activity. This alert has NOT been tested extensively.\
- https://0xv1n.github.io/LOLGlobs/about
dispatch.earliest_time = -20m@m
dispatch.latest_time = -5m@m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
schedule_window = auto
search = | tstats `security_content_summariesonly` count min(_time) AS firstTime max(_time) AS lastTime FROM datamodel=sigma_windows.process_creation WHERE process_creation.Image IN ("*powershell.exe" "*cmd.exe") BY process_creation.ParentImage process_creation.ParentCommandLine process_creation.CommandLine process_creation.User process_creation.dest_name \
| `drop_dm_object_name(process_creation)` \
| rename CommandLine AS CommandLine_ScriptBlockText\
| eval vendor_product="Microsoft Sysmon"\
| append \
    [| tstats `security_content_summariesonly` count min(_time) AS firstTime max(_time) AS lastTime FROM datamodel=sigma_windows.ps_script BY ps_script.ScriptBlockText ps_script.dest_name \
    | `drop_dm_object_name(ps_script)` \
    | rename ScriptBlockText AS CommandLine_ScriptBlockText\
    | eval vendor_product="Microsoft PowerShell"\
        ] \
| regex CommandLine_ScriptBlockText="(\(gcm|gal|Get-Command|Get-Alias|get-command|get-alias|where|dir)(.*[\*\?\[\]\{\}].*\))"\
| `security_content_ctime(firstTime)` \
| `security_content_ctime(lastTime)`\
| eval User=if(isnotnull(User), User, "unknown")\
| table dest_name User CommandLine_ScriptBlockText firstTime lastTime vendor_product count\
| `lolglob_execution_with_powerShell_or_cmd_filter`
