| tstats `security_content_summariesonly` count min(_time) AS firstTime max(_time) AS lastTime FROM datamodel=sigma_windows.process_creation WHERE process_creation.Image IN ("*powershell.exe" "*cmd.exe") BY process_creation.ParentImage process_creation.ParentCommandLine process_creation.CommandLine process_creation.User process_creation.dest_name 
| `drop_dm_object_name(process_creation)` 
| rename CommandLine AS CommandLine_ScriptBlockText
| eval vendor_product="Microsoft Sysmon"
| append 
    [| tstats `security_content_summariesonly` count min(_time) AS firstTime max(_time) AS lastTime FROM datamodel=sigma_windows.ps_script BY ps_script.ScriptBlockText ps_script.dest_name 
    | `drop_dm_object_name(ps_script)` 
    | rename ScriptBlockText AS CommandLine_ScriptBlockText
    | eval vendor_product="Microsoft PowerShell"
        ] 
| regex CommandLine_ScriptBlockText="(\(gcm|gal|Get-Command|Get-Alias|get-command|get-alias|where|dir)(.*[\*\?\[\]\{\}].*\))"
| `security_content_ctime(firstTime)` 
| `security_content_ctime(lastTime)`
| eval User=if(isnotnull(User), User, "unknown")
| table dest_name User CommandLine_ScriptBlockText firstTime lastTime vendor_product count
| `lolglob_execution_with_powerShell_or_cmd_filter`
