[Endpoint - LOLGlob in Process Creation Event - Rule]
action.correlationsearch.annotations = {"mitre_attack": ["T1059.001", "T1059.003"]}
action.correlationsearch.detection_type = ebd
action.correlationsearch.enabled = 1
action.correlationsearch.label = LOLGlob in Process Creation Event
action.email.pdf.footer_enabled = 1
action.email.pdf.header_enabled = 1
action.email.pdf.html_image_rendering = 1
action.keyindicator.invert = 0
action.makestreams.param.verbose = 0
action.nbtstat.param.verbose = 0
action.notable = 1
action.notable.param._entities = [{"risk_object_field":"N/A","risk_object_type":"N/A","risk_score":0}]
action.notable.param.drilldown_searches = [{"disabled":false,"earliest_offset":"$info_min_time$","latest_offset":"$info_max_time$","name":"View Detection Results","search":"| tstats `security_content_summariesonly` count min(_time) AS firstTime max(_time) AS lastTime FROM datamodel=sigma_windows.process_creation WHERE process_creation.Image IN (\"*powershell.exe\" \"*cmd.exe\") BY process_creation.ParentImage process_creation.ParentCommandLine process_creation.CommandLine process_creation.User process_creation.dest_name \r\n| `drop_dm_object_name(process_creation)` \r\n| eval vendor_product=\"Microsoft Sysmon\" \r\n| regex CommandLine=\"(?i)(gcm\\b|gal\\b|get-command\\b|get-alias\\b|getcommand|getalias|\\bdir\\b|\\bfor\\b|\\bforfiles\\b).*([\\*\\?\\`\\[\\{])\" \r\n| `security_content_ctime(firstTime)` \r\n| `security_content_ctime(lastTime)` \r\n| eval User=if(isnotnull(User), User, \"unknown\") \r\n| table dest_name User CommandLine firstTime lastTime vendor_product count \r\n| `lolglob_in_process_creation_filter`\r\n| search User=\"$User$\" dest_name=\"$dest_name$\""}]
action.notable.param.investigation_type = default
action.notable.param.rule_description = Glob patters are a way malicious actors can evade detection. This analytic will review PowerShell and CMD execution to see if this is occurring. By checking for the use of Get-Command or Get-Alias and their respective aliases, tied with and wild card that is valid for these shells we can alert on the activity. This alert has NOT been tested extensively.\
- https://0xv1n.github.io/LOLGlobs/about
action.notable.param.rule_title = LOLGlob in Process Creation Event
action.notable.param.security_domain = endpoint
action.notable.param.severity = high
action.notable.param.verbose = 0
action.nslookup.param.verbose = 0
action.ping.param.verbose = 0
action.risk.forceCsvResults = 1
action.risk.param._risk = []
action.risk.param.verbose = 0
action.send2uba.param.verbose = 0
action.threat_add.param.verbose = 0
action.webhook.enable_allowlist = 0
alert.suppress = 0
alert.suppress.period = 0s
alert.track = 1
allow_skew = 100%
counttype = number of events
cron_schedule = */15 * * * *
description = Glob patters are a way malicious actors can evade detection. This analytic will review PowerShell and CMD execution to see if this is occurring. By checking for the use of Get-Command or Get-Alias and their respective aliases, tied with and wild card that is valid for these shells we can alert on the activity. This alert has NOT been tested extensively.\
- https://0xv1n.github.io/LOLGlobs/about
dispatch.earliest_time = -20m@m
dispatch.latest_time = -5m@m
dispatch.rt_backfill = 1
enableSched = 1
quantity = 0
relation = greater than
request.ui_dispatch_app = SplunkEnterpriseSecuritySuite
schedule_window = auto
search = | tstats `security_content_summariesonly` count min(_time) AS firstTime max(_time) AS lastTime FROM datamodel=sigma_windows.process_creation WHERE process_creation.Image IN ("*powershell.exe" "*cmd.exe") BY process_creation.ParentImage process_creation.ParentCommandLine process_creation.CommandLine process_creation.User process_creation.dest_name \
| `drop_dm_object_name(process_creation)` \
| eval vendor_product="Microsoft Sysmon" \
| regex CommandLine="(?i)(gcm\b|gal\b|get-command\b|get-alias\b|getcommand|getalias|\bdir\b|\bfor\b|\bforfiles\b).*([\*\?\`\[\{])" \
| `security_content_ctime(firstTime)` \
| `security_content_ctime(lastTime)` \
| eval User=if(isnotnull(User), User, "unknown") \
| table dest_name User CommandLine firstTime lastTime vendor_product count \
| `lolglob_in_process_creation_filter`
