title: LOLGlob Execution with PowerShell or CMD
id: 6f8069ae-ae92-4815-8f2e-354865b36ce5
status: test
description: |
    Glob patters are a way malicious actors can evade detection. This analytic will review PowerShell and CMD execution to see if this is occurring.
    By checking for the use of Get-Command or Get-Alias and their respective aliases, tied with and wild card that is valid for these shells we |
    can alert on the activity. This alert has NOT been tested extensively.
author: Ian Dougherty [@B0und13ss]
references:
    - https://0xv1n.github.io/LOLGlobs/about
date: 2026-05-11
modified: 2026-05-11
tags:
    - attack.execution
    - attack.t1059.001
    - attack.t1059.003
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith:
            - 'powershell.exe'
            - 'cmd.exe'
    selection_cli:
        CommandLine|re|i: (\(gcm|gal|Get-Command|Get-Alias|get-command|get-alias|where|dir)(.*[\*\?\[\]\{\}].*\))
    condition: all of selection_*
falsepositives:
    - Unlikely
level: high
